In [2]:
#pandas

import pandas as pd

In [4]:
a=pd.read_csv('pandas_test.csv')

In [5]:
a

   id name  salary
0   1    a     100
1   2    b     200
2   3    c     300

In [6]:
type(a)

pandas.core.frame.DataFrame

In [7]:
a.head(1)

   id name  salary
0   1    a     100

In [9]:
a.tail(1)

   id name  salary
2   3    c     300

In [10]:
a.dtypes

id         int64
name      object
salary     int64
dtype: object

In [11]:
a['name']

0    a
1    b
2    c
Name: name, dtype: object

In [12]:
type(a['name'])

pandas.core.series.Series

In [13]:
list(a['name']) #in series we can see indexes

['a', 'b', 'c']

In [14]:
a[['name']]

  name
0    a
1    b
2    c

In [15]:
type(a[['name']])

pandas.core.frame.DataFrame

In [16]:
a['name','id']

KeyError: ('name', 'id')

In [17]:
a[['id','name']]

   id name
0   1    a
1   2    b
2   3    c

In [23]:
b=pd.read_csv('pandas_test.csv',header=None,names=['x','y','z','q'])

In [24]:
b

    x     y       z   q
0  id  name  salary NaN
1   1     a     100 NaN
2   2     b     200 NaN
3   3     c     300 NaN

In [25]:
#pd.read_table('') //if the data is in tabular format

In [26]:
b=pd.read_csv('pandas_test.csv',header=None,names=['x','y'])

In [27]:
b

       x       y
id  name  salary
1      a     100
2      b     200
3      c     300

In [30]:
c=pd.read_csv('pandas_test.csv',index_col=['name'])
c

      id  salary
name
a      1     100
b      2     200
c      3     300

In [31]:
pd.read_csv('code_pandas1/examples/ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [32]:
pd.read_csv('code_pandas1/examples/ex5.csv')

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [33]:
pd.read_csv('code_pandas1/examples/ex5.csv',na_values=['one',8])

  something  a   b     c     d message
0       NaN  1   2   3.0   4.0     NaN
1       two  5   6   NaN   NaN   world
2     three  9  10  11.0  12.0     foo

In [34]:
#pd.read_excel(r'test.xlsx',sheet_name='sheetname') r is unicode character

In [35]:
pwd()

'C:\\Users\\jagad'

In [3]:
import pandas as pd

In [10]:
df1=pd.read_excel('C:/Users/jagad/Desktop/Ineruon-Python/excel_test.xlsx', header=None,sheet_name='s1')
df1

    0     1    2
0  id  name  age
1   1     a   10
2   2     b   20
3   3     c   30
4   4     d   30
5   5     e   40

In [11]:
df1.head(2)

    0     1    2
0  id  name  age
1   1     a   10

In [12]:
df1.tail(6)

    0     1    2
0  id  name  age
1   1     a   10
2   2     b   20
3   3     c   30
4   4     d   30
5   5     e   40

In [13]:
df1.dtypes

0    object
1    object
2    object
dtype: object

In [14]:
dfddf1['id']

KeyError: 'id'

In [15]:
df1[0]

0    id
1     1
2     2
3     3
4     4
5     5
Name: 0, dtype: object

list

In [26]:
df2=pd.read_html('https://www.basketball-reference.com/leagues/NBA_2015_totals.html')

In [31]:
df2

[      Rk          Player Pos Age   Tm   G  GS    MP   FG  FGA  ...   FT%  ORB  \
 0      1      Quincy Acy  PF  24  NYK  68  22  1287  152  331  ...  .784   79
 1      2    Jordan Adams  SG  20  MEM  30   0   248   35   86  ...  .609    9
 2      3    Steven Adams   C  21  OKC  70  67  1771  217  399  ...  .502  199
 3      4     Jeff Adrien  PF  28  MIN  17   0   215   19   44  ...  .579   23
 4      5   Arron Afflalo  SG  29  TOT  78  72  2502  375  884  ...  .843   27
 ..   ...             ...  ..  ..  ...  ..  ..   ...  ...  ...  ...   ...  ...
 670  490  Thaddeus Young  PF  26  TOT  76  68  2434  451  968  ...  .655  127
 671  490  Thaddeus Young  PF  26  MIN  48  48  1605  289  641  ...  .682   75
 672  490  Thaddeus Young  PF  26  BRK  28  20   829  162  327  ...  .606   52
 673  491     Cody Zeller   C  22  CHO  62  45  1487  172  373  ...  .774   97
 674  492    Tyler Zeller   C  25  BOS  82  59  1731  340  619  ...  .823  146

      DRB  TRB  AST  STL BLK  TOV   PF   PTS
 0    222  301   68   27  22   60  147   398
 1     19   28   16   16   7   14   24    94
 2    324  523   66   38  86   99  222   537
 3     54   77   15    4   9    9   30    60
 4    220  247  129   41   7  116  167  1035
 ..   ...  ...  ...  ...  ..  ...  ...   ...
 670  284  411  173  124  25  117  171  1071
 671  170  245  135   86  17   75  115   685
 672  114  166   38   38   8   42   56   386
 673  265  362  100   34  49   62  156   472
 674  319  465  113   18  52   76  205   833

 [675 rows x 30 columns]]

In [28]:
type(df2)

list

In [29]:
len(df2)

1

In [30]:
df2[0]

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
670,490,Thaddeus Young,PF,26,TOT,76,68,2434,451,968,...,.655,127,284,411,173,124,25,117,171,1071
671,490,Thaddeus Young,PF,26,MIN,48,48,1605,289,641,...,.682,75,170,245,135,86,17,75,115,685
672,490,Thaddeus Young,PF,26,BRK,28,20,829,162,327,...,.606,52,114,166,38,38,8,42,56,386
673,491,Cody Zeller,C,22,CHO,62,45,1487,172,373,...,.774,97,265,362,100,34,49,62,156,472
674,492,Tyler Zeller,C,25,BOS,82,59,1731,340,619,...,.823,146,319,465,113,18,52,76,205,833

In [32]:
df2[::-1]

[      Rk          Player Pos Age   Tm   G  GS    MP   FG  FGA  ...   FT%  ORB  \
 0      1      Quincy Acy  PF  24  NYK  68  22  1287  152  331  ...  .784   79
 1      2    Jordan Adams  SG  20  MEM  30   0   248   35   86  ...  .609    9
 2      3    Steven Adams   C  21  OKC  70  67  1771  217  399  ...  .502  199
 3      4     Jeff Adrien  PF  28  MIN  17   0   215   19   44  ...  .579   23
 4      5   Arron Afflalo  SG  29  TOT  78  72  2502  375  884  ...  .843   27
 ..   ...             ...  ..  ..  ...  ..  ..   ...  ...  ...  ...   ...  ...
 670  490  Thaddeus Young  PF  26  TOT  76  68  2434  451  968  ...  .655  127
 671  490  Thaddeus Young  PF  26  MIN  48  48  1605  289  641  ...  .682   75
 672  490  Thaddeus Young  PF  26  BRK  28  20   829  162  327  ...  .606   52
 673  491     Cody Zeller   C  22  CHO  62  45  1487  172  373  ...  .774   97
 674  492    Tyler Zeller   C  25  BOS  82  59  1731  340  619  ...  .823  146

      DRB  TRB  AST  STL BLK  TOV   PF   PTS
 0    222  301   68   27  22   60  147   398
 1     19   28   16   16   7   14   24    94
 2    324  523   66   38  86   99  222   537
 3     54   77   15    4   9    9   30    60
 4    220  247  129   41   7  116  167  1035
 ..   ...  ...  ...  ...  ..  ...  ...   ...
 670  284  411  173  124  25  117  171  1071
 671  170  245  135   86  17   75  115   685
 672  114  166   38   38   8   42   56   386
 673  265  362  100   34  49   62  156   472
 674  319  465  113   18  52   76  205   833

 [675 rows x 30 columns]]

In [34]:
df2.reverse()

In [36]:
df2.pop()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
670,490,Thaddeus Young,PF,26,TOT,76,68,2434,451,968,...,.655,127,284,411,173,124,25,117,171,1071
671,490,Thaddeus Young,PF,26,MIN,48,48,1605,289,641,...,.682,75,170,245,135,86,17,75,115,685
672,490,Thaddeus Young,PF,26,BRK,28,20,829,162,327,...,.606,52,114,166,38,38,8,42,56,386
673,491,Cody Zeller,C,22,CHO,62,45,1487,172,373,...,.774,97,265,362,100,34,49,62,156,472
674,492,Tyler Zeller,C,25,BOS,82,59,1731,340,619,...,.823,146,319,465,113,18,52,76,205,833

In [37]:
df2

[]

In [38]:
df3=pd.read_html('https://www.basketball-reference.com/leagues/NBA_2015_totals.html')

In [39]:
df3[0].columns

Index(['Rk', 'Player', 'Pos', 'Age', 'Tm', 'G', 'GS', 'MP', 'FG', 'FGA', 'FG%',
       '3P', '3PA', '3P%', '2P', '2PA', '2P%', 'eFG%', 'FT', 'FTA', 'FT%',
       'ORB', 'DRB', 'TRB', 'AST', 'STL', 'BLK', 'TOV', 'PF', 'PTS'],
      dtype='object')

In [40]:
#BEAUTIFUL SOAP GETS THE ANY KIND OF DATA FROM WEBPAGE

In [44]:
df4=pd.read_csv('https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv', sep='\t')

In [45]:
df4.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [48]:
df4[['Ticket']]

               Ticket
0           A/5 21171
1            PC 17599
2    STON/O2. 3101282
3              113803
4              373450
..                ...
151            113776
152        A.5. 11206
153          A/5. 851
154         Fa 265302
155          PC 17597

[156 rows x 1 columns]

In [66]:
df4=pd.read_csv('https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv', sep='\t', nrows=10,names=['a','b','c','d','e','f','g','h','i','j','k','l'])

In [56]:
df4.to_csv('saved_file.csv')

In [67]:
#nrows is less expensieve opera
df4.to_csv('saved_file_tab.tsv', sep='\t', index=False,columns=['a','b','c','d','e','f','g','h','i','j','k','l'])

In [52]:
df4=pd.read_csv('https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv', sep='\t', chunksize=300)

In [69]:
#write as binary file
a=pd.read_csv('code_pandas1\\examples\\ex1.csv')
a.to_pickle("testpick") #object to byte code, serila--

In [70]:
pd.read_pickle('testpick')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo